#### ExportColorMode Enumeration

---

|  |
| --- |
| See Also |

An enumerated type listing export color mode.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public enum ExportColorMode ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration ExportColorMode ``` |

| Visual C++ |
| --- |
| ``` public enum class ExportColorMode ``` |

# Members

| Member name | Description |
| --- | --- |
| IndexColors | All colors from the Revit project will be set to the closest of the 255 AutoCAD Color Index colors. |
| TrueColor | All colors from the Revit project will be exported as 24-bit RGB values as specified in object styles. |
| TrueColorPerView | All colors from the Revit project will be exported as 24-bit RGB values as specified in view. |

# See Also

Autodesk.Revit.DB Namespace